using System.Collections.Generic;

namespace CyberpunkRED_Generator
{
    public static partial class CoreDataBase
    {

        public static readonly string[] Roles = {
            "Рокербой", "Соло", "Нетраннер", "Техник", "Медтехник",
            "Медиа", "Законник", "Корпорат", "Фиксер", "Кочевник"
        };

        //СПАРШЕНО!!!!!!!!!!!!
        public static readonly SkillDef[] AllSkills = new SkillDef[]
        {
            // Навыки Восприятия
            new SkillDef { Category = "Навыки Восприятия", Name = "Внимательность", Stat = "ИНТ", IsBasic = true, IsX2 = false,
                Description = "Навык обнаружения скрытых вещей, например подсказки, ловушки, прячущихся людей. Но не предметов, скрытых с помощью навыка Скрытие/раскрытие объекта." },
            new SkillDef { Category = "Навыки Восприятия", Name = "Выслеживание", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Способность идти по следу с использованием улик, следов и подсказок, встреченных ранее." },
            new SkillDef { Category = "Навыки Восприятия", Name = "Концентрация", Stat = "ВОЛЯ", IsBasic = true, IsX2 = false,
                Description = "Навык сосредоточения, памяти, запоминания информации, игнорирования отвлекающих факторов." },
            new SkillDef { Category = "Навыки Восприятия", Name = "Скрытие/раскрытие объекта", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Умение прятать предметы и находить спрятанные предметы. Этот навык используется для скрытия или обнаружения спрятанного оружия под одеждой." },
            new SkillDef { Category = "Навыки Восприятия", Name = "Чтение по губам", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Умение читать по губам разговор людей на расстоянии, чтобы понимать, что они обсуждают." },

            // Физические Навыки
            new SkillDef { Category = "Физические Навыки", Name = "Атлетика", Stat = "ЛВК", IsBasic = true, IsX2 = false,
                Description = "Умение лазать, метать, прыгать, плавать, поднимать тяжести и т.д." },
            new SkillDef { Category = "Физические Навыки", Name = "Акробатика", Stat = "ЛВК", IsBasic = false, IsX2 = false,
                Description = "Способность избавиться от наручников или других пут, пролезть в недоступные места или пространства" },
            new SkillDef { Category = "Физические Навыки", Name = "Выносливость", Stat = "ВОЛЯ", IsBasic = false, IsX2 = false,
                Description = "Превозмогание суровых условий, тягостей и лишений" },
            new SkillDef { Category = "Физические Навыки", Name = "Скрытность", Stat = "ЛВК", IsBasic = true, IsX2 = false,
                Description = "Умение незаметно двигаться, прятаться, действовать скрытно. Вас могут найти с помощью навыка внимательности" },
            new SkillDef { Category = "Физические Навыки", Name = "Сопр. пыткам/наркотикам", Stat = "ВОЛЯ", IsBasic = false, IsX2 = false,
                Description = "Сопротивление болезненным воздействиями допросов, пыток, наркотиков и других веществ" },
            new SkillDef { Category = "Физические Навыки", Name = "Танец", Stat = "ЛВК", IsBasic = false, IsX2 = false,
                Description = "Навык профессионального танца." },

            // Навыки Управления
            new SkillDef { Category = "Навыки Управления", Name = "Верховая езда", Stat = "РЕА", IsBasic = false, IsX2 = false,
                Description = "Езда на живом существе, обученном этому" },
            new SkillDef { Category = "Навыки Управления", Name = "Вождение", Stat = "РЕА", IsBasic = false, IsX2 = false,
                Description = "Навык вождения и маневрирования наземным транспортом" },
            new SkillDef { Category = "Навыки Управления", Name = "Пилотирование (x2)", Stat = "РЕА", IsBasic = false, IsX2 = true,
                Description = "Навык управления летательными аппаратами" },
            new SkillDef { Category = "Навыки Управления", Name = "Судоходство", Stat = "РЕА", IsBasic = false, IsX2 = false,
                Description = "Управление и маневрирование морскими судами" },

            // Образовательные Навыки
            new SkillDef { Category = "Образовательные Навыки", Name = "Азартные игры", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Навык, позволяющий рассчитывать шансы и успешно играть в азартные игры" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Бизнес", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Умение вести дела, строить бизнес, знание законов спроса и предложения, закупок, продаж, маркетинга" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Бухгалтерия", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Умение балансировать бухгалтерскую отчетность, создавать поддельные бух. книги, идентифицировать их, жонглировать цифрами, составлять бюджеты" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Бюрократия", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Общение с бюрократами, вы знаете как и с кем связаться, как вытащить информацию из них" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Выживание в пустыне", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Навык выживания в дикой природе и/или суровых условиях" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Дедукция", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Способность сделать не очевидный вывод или вынести медицинский диагноз из подсказок" },


            new SkillDef { Category = "Образовательные Навыки", Name = "Знание местности (Твой дом)", Stat = "ИНТ", IsBasic = true, IsX2 = false,
                Description = "Позволяет хорошо знать определенный район и разбираться в планах различных группировок, как политических, так и преступных. Каждый раз, когда ты повышаешь этот навык, ты должен выбрать конкретное место, которое не может быть больше, чем один район или община" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Знание местности", Stat = "ИНТ", IsBasic = false, IsX2 = false, CanAddMultiple = true,
                Description = "Позволяет хорошо знать определенный район и разбираться в планах различных группировок, как политических, так и преступных. Каждый раз, когда ты повышаешь этот навык, ты должен выбрать конкретное место, которое не может быть больше, чем один район или община" },


            new SkillDef { Category = "Образовательные Навыки", Name = "Композиция", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Умение профессионально писать песни, статьи и рассказы" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Криминология", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Поиск отпечатков пальцев, проведение баллистических тестов, поиск улик через просмотр полицейских файлов и записей" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Криптография", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Умение шифровать и дешифровать сообщения" },


            new SkillDef { Category = "Образовательные Навыки", Name = "Наука", Stat = "ИНТ", IsBasic = false, IsX2 = false, CanAddMultiple = true,
                Description = "Навык, позволяющий ставить эксперименты, писать научные статьи, проверять гипотезы и вести дискуссии с другими учеными в определенной области науки. При повышении этого навыка необходимо указать область исследования. Возможные варианты включают: Геология, математика, физика, зоология, антропология, биология, химия, история и т.д" },


            new SkillDef { Category = "Образовательные Навыки", Name = "Образование", Stat = "ИНТ", IsBasic = true, IsX2 = false,
                Description = "Навык общих знаний, эквивалентный школьному образованию, позволяющий читать, писать и знать достаточно, чтобы свести концы с концами" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Обращ. с животными", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Навык дрессировки, тренировки и ухода за зверушками" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Поиск информации", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Навык использования Дата Пулов, серверов, библиотек и других источников информации для поиска фактов" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Тактика", Stat = "ИНТ", IsBasic = false, IsX2 = false,
                Description = "Навык управления крупномасштабными боевыми действиями. Персонажи с этим навыком обычно знают, как провести битву и как могут отреагировать вражеские силы" },


            new SkillDef { Category = "Образовательные Навыки", Name = "Язык (Уличный Сленг)", Stat = "ИНТ", IsBasic = true, IsX2 = false,
                Description = "Умение говорить на определенном языке. Вы должны выбрать определенный язык, когда повышаете этот навык" },
            new SkillDef { Category = "Образовательные Навыки", Name = "Язык (Родной)", Stat = "ИНТ", IsBasic = false, IsX2 = false, FreeLevels = 4,
                Description = "Язык вашего культурного происхождения. Дается бесплатно на 4 уровне." },
            new SkillDef { Category = "Образовательные Навыки", Name = "Язык", Stat = "ИНТ", IsBasic = false, IsX2 = false, CanAddMultiple = true,
                Description = "Умение говорить на определенном языке. Вы должны выбрать определенный язык, когда повышаете этот навык" },


            // Ближний бой
            new SkillDef { Category = "Ближний бой", Name = "Боевые искусства (x2)", Stat = "ЛВК", IsBasic = false, IsX2 = true, CanAddMultiple = true,
                Description = "Навык, позволяющий использовать одно из боевых искусств. Когда ты повышаешь этот навык, ты должен выбрать боевое искусство. Можно изучать несколько, но делать это нужно отдельно. Возможные варианты (карате, тхэквондо, дзюдо, айкидо). Подробнее можно найти на СТР 178." },
            new SkillDef { Category = "Ближний бой", Name = "Оружие ближнего боя", Stat = "ЛВК", IsBasic = false, IsX2 = false,
                Description = "Умение драться холодным оружием." },
            new SkillDef { Category = "Ближний бой", Name = "Рукопашный бой", Stat = "ЛВК", IsBasic = true, IsX2 = false,
                Description = "Умение драться и бороться с помощью грубой силы" },
            new SkillDef { Category = "Ближний бой", Name = "Уклонение", Stat = "ЛВК", IsBasic = true, IsX2 = false,
                Description = "Умение уходить с пути того, кто атакует вас в ближнем бою. Персонаж с РЕА 8 и выше может использовать этот навык для уклонения от дальних атак" },

            // Сценические Навыки
            new SkillDef { Category = "Сценические Навыки", Name = "Актерское мастерство", Stat = "ХАР", IsBasic = false, IsX2 = false,
                Description = "Умение играть роли, маскироваться под кого-то реального или вымышленного, имитировать эмоции и настроения" },
            new SkillDef { Category = "Сценические Навыки", Name = "Игра на инструментах", Stat = "ТЕХ", IsBasic = false, IsX2 = false, CanAddMultiple = true,
                Description = "Умение профессионально играть на музыкальном инструменте. При повышении этого навыка ты можешь выбрать, на каком инструменте. Возможные варианты: пение, гитара, барабаны, скрипка, фортепиано и т.д." },

            // Дальний бой
            new SkillDef { Category = "Дальний бой", Name = "Автоматический огонь (x2)", Stat = "РЕА", IsBasic = false, IsX2 = true,
                Description = "Навык удержания цели в прицеле в режиме автоматического огня, контролируя отдачу" },
            new SkillDef { Category = "Дальний бой", Name = "Оружие кр. калибра (x2)", Stat = "РЕА", IsBasic = false, IsX2 = true,
                Description = "Навык точной стрельбы из крупнокалиберного оружия, включая гранатометы и ракетные установки" },
            new SkillDef { Category = "Дальний бой", Name = "Пистолеты", Stat = "РЕА", IsBasic = false, IsX2 = false,
                Description = "Навык стрельбы из легкого ручного оружия, проще говоря, пистолетов" },
            new SkillDef { Category = "Дальний бой", Name = "Стрельба из лука", Stat = "РЕА", IsBasic = false, IsX2 = false,
                Description = "Навык стрельбы из оружия, использующего стрелы или болты" },
            new SkillDef { Category = "Дальний бой", Name = "Тактическое оружие", Stat = "РЕА", IsBasic = false, IsX2 = false,
                Description = "Навык стрельбы из переносимого тактического вооружения с плечевым упором, такового как винтовки, дробовики и т.д." },

            // Социальные Навыки
            new SkillDef { Category = "Социальные Навыки", Name = "Гардероб и стиль", Stat = "ХАР", IsBasic = false, IsX2 = false,
                Description = "Вы знаете что и как нужно надеть для каждой конкретной ситуации" },
            new SkillDef { Category = "Социальные Навыки", Name = "Допрос", Stat = "ХАР", IsBasic = false, IsX2 = false,
                Description = "Навык насильственного извлечения информации" },
            new SkillDef { Category = "Социальные Навыки", Name = "Знаток Улиц", Stat = "ХАР", IsBasic = false, IsX2 = false,
                Description = "Умение устанавливать контакты для получения незаконных товаров и контрабанды, ведение переговоров с криминальными структурами. Так же позволяет избегать плохих ситуаций в плохих районах" },
            new SkillDef { Category = "Социальные Навыки", Name = "Общение", Stat = "ЭМП", IsBasic = true, IsX2 = false,
                Description = "Умение вытягивать информацию из людей, не вызывая подозрений при разговоре" },
            new SkillDef { Category = "Социальные Навыки", Name = "Подкуп", Stat = "ХАР", IsBasic = false, IsX2 = false,
                Description = "Умение подкупить человека, понимание как к нему подойти и сколько предложить" },
            new SkillDef { Category = "Социальные Навыки", Name = "Проницательность", Stat = "ЭМП", IsBasic = true, IsX2 = false,
                Description = "Умение читать выражение лица, язык тела, различать эмоциональное состояние и обнаруживать ложь и обман" },
            new SkillDef { Category = "Социальные Навыки", Name = "Торговля", Stat = "ХАР", IsBasic = false, IsX2 = false,
                Description = "Умение заключать выгодные контракты с торговцами или заказчиками" },
            new SkillDef { Category = "Социальные Навыки", Name = "Убеждение", Stat = "ХАР", IsBasic = true, IsX2 = false,
                Description = "Умение убеждать, уговаривать или оказывать влияние на людей" },
            new SkillDef { Category = "Социальные Навыки", Name = "Уход за собой", Stat = "ХАР", IsBasic = false, IsX2 = false,
                Description = "Навык ухода за своим внешним видом, чтобы выглядеть максимально привлекательно" },

            // Технические Навыки
            new SkillDef { Category = "Технические Навыки", Name = "Авиационные технологии", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Умение ремонтировать авиатехнику" },
            new SkillDef { Category = "Технические Навыки", Name = "Автомеханика", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Умение ремонтировать автомобили и мотоциклы" },
            new SkillDef { Category = "Технические Навыки", Name = "Взлом замков", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Навык взлома не электронных замков" },
            new SkillDef { Category = "Технические Навыки", Name = "Знание техники", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Умение определять, понимать и ремонтировать простые электронные и механические устройства, а также все другие предметы, которые не относятся к другим техническим навыкам. Это навык Базовой или Общей технологии" },
            new SkillDef { Category = "Технические Навыки", Name = "Карманник", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Навык кражи предметов, закрепленных на другом человеке, кражи мелких вещей в магазине, оставаясь незамеченным" },
            new SkillDef { Category = "Технические Навыки", Name = "Кибертехника", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Навык определения, понимания и ремонта киберимплантов" },
            new SkillDef { Category = "Технические Навыки", Name = "Кино- и фототехника", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Создание фото, видео или брейндансов" },
            new SkillDef { Category = "Технические Навыки", Name = "Морские технологии", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Умение ремонтировать водный транспорт" },
            new SkillDef { Category = "Технические Навыки", Name = "Оружейник", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Навык ремонта и обслуживание оружия всех типов" },
            new SkillDef { Category = "Технические Навыки", Name = "Парамедик (x2)", Stat = "ТЕХ", IsBasic = false, IsX2 = true,
                Description = "Навык лечения к раненых людей для устранения всех критических ранений и предотвращения его смерти, не требующих хирургии, (хирургия доступна только медтехникам через их ролевую способность \"Медицина\")" },
            new SkillDef { Category = "Технические Навыки", Name = "Первая помощь", Stat = "ТЕХ", IsBasic = true, IsX2 = false,
                Description = "Навык применения медицинских процедур к раненому человеку для лечения наиболее распространенных критических ранений и предотвращения смерти" },
            new SkillDef { Category = "Технические Навыки", Name = "Подрывник (x2)", Stat = "ТЕХ", IsBasic = false, IsX2 = true,
                Description = "Навык установки и обезвреживания взрывчатки, а также полное понимание, сколько тротила нужно, чтобы снести конкретную стену" },
            new SkillDef { Category = "Технические Навыки", Name = "Фальсификация", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Умение создавать и обнаруживать фальшивые документы и ID-карты" },
            new SkillDef { Category = "Технические Навыки", Name = "Художественное ремесло", Stat = "ТЕХ", IsBasic = false, IsX2 = false,
                Description = "Навык профессионального создания картин, рисунков или скульптур" },
            new SkillDef { Category = "Технические Навыки", Name = "Электроника/Безопасность (x2)", Stat = "ТЕХ", IsBasic = false, IsX2 = true,
                Description = "Знание, понимание, ремонт, консультирование и установка, взлом сложных электронных устройств, включая: компьютеры, кибердеки, персональную электронику, электронные системы безопасности, жучки и маячки, нажимные пластины, лазерные ловушки и т.д." }
        };
    }
}
