using System.Collections.Generic;

namespace CyberpunkRED_Generator
{
    // структура для инициализации навыка из базы
    public class SkillDef
    {
        public string Category { get; set; }
        public string Name { get; set; }
        public string Stat { get; set; }
        public bool IsBasic { get; set; }
        public bool IsX2 { get; set; }
        public string Description { get; set; }
        public bool CanAddMultiple { get; set; }
        public int FreeLevels { get; set; } = 0;
    }
    public class SkillModifierDef
    {
        public string SkillName { get; set; } // какому навыку даем бонус (или "Все")
        public int Value { get; set; }        // значение (+1, -4 и т.д.)
        public string ModType { get; set; } = "Normal"; // "Normal", "Visual", "Audio"
    }
    // вспомогательный класс для таблиц ролевого пути
    public class RoleLifepathTable
    {
        public string Title { get; set; }
        public string[] Options { get; set; }
        public string DependsOn { get; set; } // заголовок таблицы, от ответа в которой зависит эта (null — показывается всегда)
        public string[] ShowIf { get; set; }  // при каких ответах в таблице DependsOn эта таблица показывается
    }

    // структура для инициализации травм из базы
    public class CriticalInjuryDef
    {
        public string Name { get; set; }
        public string Description { get; set; }
        public string EffectText { get; set; }
        public string QuickFix { get; set; }
        public string Treatment { get; set; }
        public int AllActionsPenalty { get; set; }
        public int MovePenalty { get; set; }
        public int DeathSavePenalty { get; set; }

        public List<SkillModifierDef> SkillModifiers { get; set; } = new List<SkillModifierDef>();
    }

    public static partial class CoreDataBase
    {
        public static readonly string[] Origins = {
            "Северная Америка",
            "Южная / Центральная Америка",
            "Западная Европа",
            "Восточная Европа",
            "Ближний Восток / Северная Африка",
            "Чёрная Африка",
            "Южная Азия",
            "Юго-Восточная Азия",
            "Восточная Азия",
            "Океания / Тихоокеанские острова" };

        public static readonly string[] Personalities = {
            "Застенчивый и скрытный",
            "Бунтарь, антисоциальный, жестокий",
            "Высокомерный, гордый и отстранённый",
            "Капризный, вспыльчивый и упрямый",
            "Придирчивый, суетливый и нервный",
            "Уравновешенный и серьезный",
            "Глуповатый и легкомысленный",
            "Хитрый и обманчивый",
            "Интеллектуал и отстраненный",
            "Дружелюбный и общительный" };

        public static readonly string[] Clothing = {
            "Generic Chic (стандартный, яркий, модульный) ",
            "Leisurewear (комфорт, ловкость, спортивный) ",
            "Urban Flash (яркий, технологичный, уличный)",
            "Businesswear (лидерский, авторитетный, презентабельный)",
            "High Fashion (эксклюзивный, дизайнерский, кутюр)",
            "Bohemian (народный, ретро, свободолюбивый) ",
            "Bag Lady Chic (бездомный, рваный, бродяжный)",
            "Gang Colors (опасный, агрессивный, бунтарский)",
            "Nomad Leathers (вестерн, грубый, племенной)",
            "Asia Pop (яркий, маскарадный, молодёжный)" };

        public static readonly string[] Hair = {
            "Ирокез",
            "Длинные и растрепанные",
            "Короткие и торчащие",
            "Дикие и хаотичные",
            "Лысина",
            "Полосатые",
            "Яркие цвета",
            "Аккуратные и короткие",
            "Короткие и кудрявые",
            "Длинные и прямые" };

        public static readonly string[] Features = {
            "Татуировки",
            "Зеркальные солнцезащитные очки",
            "Ритуальные шрамы",
            "Перчатки с шипами",
            "Кольца в носу",
            "Пирсинг языка или других частей тела",
            "Странные импланты ногтей",
            "Сапоги или туфли с шипами",
            "Перчатки без пальцев",
            "Необычные контактные линзы" };

        public static readonly string[] Values = {
            "Деньги",
            "Честь",
            "Твое слово",
            "Честность",
            "Знания",
            "Месть",
            "Любовь",
            "Власть",
            "Семья",
            "Дружбу" };

        public static readonly string[] People = {
            "Я остаюсь нейтральным",
            "Я остаюсь нейтральным",
            "Мне нравятся почти все",
            "Я почти всех ненавижу",
            "Люди — это инструменты. Использую их для своих целей, а потом избавляюсь",
            "Каждый человек — ценная личность",
            "Люди — это препятствия, которые нужно уничтожить, если они мне мешают",
            "Люди ненадёжны. Не полагайся ни на кого",
            "Уничтожь всех и пусть тараканы захватят мир",
            "Люди прекрасны!" };

        public static readonly string[] Persons = {
            "Родители",
            "Брат или сестра",
            "Возлюбленный",
            "Друг",
            "Ты сам",
            "Питомец",
            "Учитель или наставник",
            "Публичная личность",
            "Личный герой",
            "Никто" };

        public static readonly string[] Possessions = {
            "Оружие",
            "Инструмент",
            "Предмет одежды",
            "Фотография",
            "Дневник",
            "Запись",
            "Музыкальный инструмент",
            "Ювелирное изделие",
            "Игрушка",
            "Письмо" };

        public static readonly string[] FamilyBackground = {
            "Руководители корпорации",
            "Корпоративные менеджеры",
            "Корпоративные техники",
            "Кочевой клан",
            "Бандитская «Семья»",
            "Обитатели Боевой Зоны",
            "Городские бездомные",
            "Крысы из мегабашен",
            "Восстановители",
            "Эджраннеры"
        };

        public static readonly string[] FamilyBackgroundDesc = {
            "Богатые, влиятельные, с прислугой, роскошными домами и лучшим из всего. Частная охрана обеспечивала твою безопасность. Ты определённо ходил в престижную частную школу.",
            "Обеспеченные, с большими домами, безопасными районами, хорошими машинами и т.д. Иногда твои родители нанимали прислугу, хотя это было редкостью. У тебя было смешанное образование: частное и корпоративное.",
            "Средний класс с удобными конаптами или пригородными домами типа бивервиля, минивэнами и корпоративными техническими школами. Что-то вроде жизни в Америке 1950-х, скрещённой с 1984.",
            "Смесь прочных трейлеров, автомобилей и огромных дорогих комби как дома. Ты научился водить и сражаться в раннем возрасте, но семья всегда заботилась о тебе. Еда была свежей и обильной. В основном домашнее обучение.",
            "Жестокий, полный насилия дом в любом месте, которое могла захватить банда. Ты часто был голодным, замёрзшим и напуганным. Вероятно, ты даже не знал своих настоящих родителей. Образование? Банда учила тебя драться, убивать и воровать — что ещё тебе нужно было знать?",
            "Шаг вверх от банды. Твой дом представлял собой разрушающееся здание где-то в Зоне, сильно укреплённое. Ты часто был голодным, но время от времени находил место, где можно было переночевать и поесть. Домашнее обучение. ",
            "Ты жил в машинах, мусорных баках или заброшенных грузовых модулях. Если тебе повезло. Ты часто был голодным, замёрзшим и напуганным, если только не был достаточно жёстким, чтобы бороться за остатки. Образование? Школа суровых ударов жизни.",
            "Ты вырос в одной из огромных новых мегаструктур, которые появились после войны. Твой дом — это крошечный конапт, киббл и скоп твоя еда, в основном тёплая кровать. Иногда более образованные взрослые из мегаструктуры или местная корпорация могли организовать школу",
            "Ты начинал в дороге, но позже переселился в один из покинутых городов-призраков или разрушенных городов, чтобы восстанавливать его. Пионерская жизнь: опасная, но полная простоты и места для сна. Тебя обучали дома, если вообще кто-то это делал",
            "Твой дом всегда менялся в зависимости от работы родителей. Это мог быть роскошный апартамент, городской конапт или мусорный контейнер, если они скрывались. Еда и кров могли варьироваться от гурмана до киббла."
        };

        public static readonly string[] ChildhoodEnvironment = {
            "Бегал по улицам без какого-либо надзора взрослых.",
            "Жил в безопасной корпоративной зоне, изолированной от остального города.",
            "Был в кочевом клане, перемещающемся с места на место.",
            "Был в кочевом клане, связанном с транспортом (корабли, самолёты, караваны).",
            "Жил в разрушающемся районе, который когда-то был престижным, теперь выживая, защищаясь от бандитов.",
            "В центре боевой зоны, живя в разрушенном здании или другом заброшенном месте.",
            "В огромной мегаструктуре, контролируемом корпорацией или городом.",
            "В руинах заброшенного города или посёлка, захваченного реконструкторами.",
            "В Плавучем городе (дрейфующей офшорной общине), служащем местом встречи для людей всех слоёв общества.",
            "В роскошном корпоративном небоскрёбе, возвышающемся над шумной толпой." };

        public static readonly string[] FamilyCrisis = {
            "Твоя семья потеряла всё из-за предательства.",
            "Твоя семья потеряла всё из-за плохого управления.",
            "Твою семью изгнали или иным образом выгнали из их родного дома/страны/корпорации.",
            "Твоя семья заключена в тюрьму, а ты один сумел сбежать.",
            "Твоя семья исчезла. Ты — единственный оставшийся в живых.",
            "Твою семью убили, и ты был единственным выжившим.",
            "Твоя семья вовлечена в долгосрочный заговор, организацию или ассоциацию, например, преступный клан или революционную группу.",
            "Твоя семья была разбросана по свету из-за несчастья. ",
            "Твоя семья проклята наследственной враждой, длящейся уже много поколений.",
            "Ты унаследовал семейный долг. Ты должен почтить этот долг, прежде чем двигаться дальше по жизни." };

        public static readonly string[] LifeGoals = {
            "Избавиться от дурной репутации.",
            "Добиться власти и контроля.",
            "Уйти с улиц любой ценой.",
            "Причинить боль и страдания каждому, кто встанет у тебя на пути.",
            "Забыть своё прошлое и попытаться его оставить позади.",
            "Найти и наказать тех, кто сделал твою жизнь несчастной. ",
            "Заполучить то, что по праву твоё.",
            "Если возможно, спасти тех, кто был вовлечён в твою историю, например, возлюбленного или члена семьи.",
            "Добиться славы и признания.",
            "Внушать страх и уважение." };

        // связи 52-53
        public static readonly string[] Friends = {
            "Как старший брат/сестра",
            "Как младший брат/сестра",
            "Учитель или наставник",
            "Партнер или коллега",
            "Бывший возлюбленный",
            "Старый враг",
            "Как родитель для тебя",
            "Старый друг детства",
            "Кто-то, кого ты знаешь с улицы",
            "Кто-то с общими интересами или целью" };

        public static readonly string[] EnemiesWho = {
            "Бывший друг",
            "Бывший возлюбленный",
            "Дальний родственник",
            "Враг детства",
            "Человек, работающий на тебя",
            "Человек, на которого работаешь ты",
            "Партнёр или коллега",
            "Корпоративный менеджер",
            "Государственный чиновник",
            "Бустер" };

        public static readonly string[] EnemiesCause = {
            "Один из вас потерял лицо или статус",
            "Потеря любви, друга или родственника",
            "Причинил крупное публичное унижение",
            "Обвинил другого в трусости или другом крупном личном недостатке",
            "Бросил или предал другого",
            "Отклонил предложение работы или романтических отношений",
            "Вы просто друг друга не выносите",
            "Один из вас был романтическим соперником",
            "Один из вас был бизнес-конкурентом",
            "Один из вас подставил другого за преступление, которого тот не совершал" };

        public static readonly string[] EnemiesWhoHates = {
            "Самостоятельно, и даже особо не будет стараться",
            "Самостоятельно",
            "Он и его близкий друг ",
            "Он и несколько (1d6/2) друзей",
            "Он и несколько (1d10/2) друзей",
            "Целая банда (1d10+5)",
            "Местные копы или законники",
            "Могущественный бандит или небольшая корпа",
            "Мощная корпа",
            "Целый город, правительство или агентство." };

        public static readonly string[] EnemiesAction = {
            "Избегать накала",
            "Избегать накала",
            "Войти в убийственную ярость и вырвать врагу лицо",
            "Войти в убийственную ярость и вырвать врагу лицо",
            "Нанести подлый удар в спину. Не обязательно в прямом смысле",
            "Нанести подлый удар в спину. Не обязательно в прямом смысле",
            "Устроить вербальную перепалку",
            "Устроить вербальную перепалку",
            "Подставить за преступление или другое деяние, которое оппонент не совершал",
            "Просто убить или покалечить" };

        public static readonly string[] TragicLove = {
            "Любовный интерес погиб в несчастном случае",
            "Твой любовный интерес таинственно исчез",
            "Вы просто не сошлись",
            "Между вами встала личная цель или вендетта",
            "Твой любовный интерес был похищен",
            "Любовный интерес сошёл с ума или стал киберпсихом",
            "Твой Любовный интерес покончил с собой",
            "Твоего партнёра (-шу) убили в драке",
            "Соперник выбил вас из игры",
            "Вашего партнёра (-шу) посадили в тюрьму или изгнали" };

    }
}
