using System.Collections.Generic;

namespace CyberpunkRED_Generator
{
    public static partial class CoreDataBase
    {
        // ролевой 55-70

        // СПАРШЕНО!!!!!!!!!!
        public static readonly Dictionary<string, RoleLifepathTable[]> RoleLifepaths = new Dictionary<string, RoleLifepathTable[]>
        {
            {
                "Рокербой", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какой ты Рокербой?",
                        Options = new[]
                        {
                            "Музыкант",
                            "Слэм поэт",
                            "Уличный художник",
                            "Исполнитель перфоманса",
                            "Юморист",
                            "Оратор",
                            "Политик",
                            "Рэпер",
                            "DJ",
                            "Идору (поп-звезда)"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Ты в группе или выступаешь соло?",
                        Options = new[]
                        {
                            "Выступаю соло",
                            "Выступаю в группе"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Ты когда-нибудь был в группе?",
                        DependsOn = "Ты в группе или выступаешь соло?",
                        ShowIf = new[] { "Выступаю соло" },
                        Options = new[]
                        {
                            "Да, раньше был в группе",
                            "Нет, всегда выступал соло"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Почему ушел из группы?",
                        DependsOn = "Ты когда-нибудь был в группе?",
                        ShowIf = new[] { "Да, раньше был в группе" },
                        Options = new[]
                        {
                            "Ты был придурком и остальная часть группа проголосовала за твой уход",
                            "Тебя поймали, когда ты спал с мейнлайнером другой группы",
                            "Остальная часть группы погибла при трагических обстоятельствах",
                            "Остальная группа была убита или иным образом уничтожена внешними врагами",
                            "Группа распалась из-за творческих разногласий",
                            "Ты просто решил пойти дальше в одиночку"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Где ты выступаешь?",
                        Options = new[]
                        {
                            "Альтернативные кафе",
                            "Частные клубы",
                            "Захудалые дайв-бары",
                            "Партизанские выступления",
                            "Ночные клубы по всему городу",
                            "В Дата Пуле"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто пытается тебе помешать?",
                        Options = new[]
                        {
                            "Старый член группы, который думает, что ты запятнал репутацию",
                            "Конкурент, пытающийся украсть долю рынка",
                            "Корпораты, которым не нравится твой посыл",
                            "Влиятельный человек, пытающийся сбить тебя с пути",
                            "Пожилая медиа-звезда, которой угрожает твоя слава",
                            "Романтический интерес или медийный деятель, который хочет отомстить по личным причинам"
                        }
                    }
                }
            },
            {
                "Соло", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какой ты Соло?",
                        Options = new[]
                        {
                            "Телохранитель",
                            "Уличный боец по найму",
                            "Корпоративный силовик на подработке",
                            "Корпоративный или внештатный специалист по “чёрным операциям”",
                            "Местный линчеватель по найму",
                            "Ассасин/Убийца по найму"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Твой моральный кодекс",
                        Options = new[]
                        {
                            "Работа во благо, в попытке истребить \"плохих парней\"",
                            "Всегда щадить невинных (старики, женщины, дети, животные)",
                            "Иногда можно оступиться, совершить неэтичные поступки, но редко",
                            "Никакой жалости, только прибыль. Ты будешь работать на кого угодно, сделаешь любую работу за деньги",
                            "Готов поступиться нормами и законами, чтобы выполнить работу",
                            "Настоящее зло. Всё время занимаешься незаконной и неэтичной работой. И тебе это нравится"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Где ты обычно работаешь",
                        Options = new[]
                        {
                            "Корпоративная зона",
                            "Боевая зона",
                            "Весь город",
                            "Территория конкретной корпорации",
                            "Территория конкретного фиксера или контракта",
                            "Где угодно, где есть деньги"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто за тобой охотится?",
                        Options = new[]
                        {
                            "Корпы, которых ты разозлил",
                            "Бустеры, с которыми ты уже сталкивался",
                            "Коррумпированные законники или корпы, которые думают, что ты в чем-то виновен",
                            "Соло из другой корпы",
                            "Фиксер, который видит в тебе угрозу",
                            "Соло, который видит в тебе врага"
                        }
                    }
                }
            },
            {
                "Нетраннер", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какой ты Нетраннер?",
                        Options = new[]
                        {
                            "Фрилансер",
                            "Корпоративный раннер, который хакает для конкретного заказчика",
                            "Хактивист, заинтересованный во взломе, чтобы разоблачать плохих парней",
                            "Взламываешь ради удовольствия",
                            "Часть команды фрилансеров",
                            "Взлом для СМИ, политиков и законников, которые нанимают тебя по необходимости"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Твой напарник",
                        Options = new[]
                        {
                            "Работаю один",
                            "Работаю один",
                            "Работаю один",
                            "У меня есть напарник",
                            "У меня есть напарник",
                            "У меня есть напарник"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто твой напарник (если есть)?",
                        Options = new[]
                        {
                            "Член семьи",
                            "Старый друг",
                            "Романтический партнёр",
                            "Тайный партнер, который может быть диким искином. Может быть.",
                            "Тайный партнёр из мафии/банды",
                            "Тайный партнер со связями в корпорации"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Твое рабочее место",
                        Options = new[]
                        {
                            "Экраны повсюду",
                            "Клянусь, в виртуальном мире оно выглядит лучше",
                            "Грязная кровать, обтянутая проводами",
                            "Корпоративное, модульное и утилитарное",
                            "Минималистичное, чистое и хорошо организованное",
                            "Оно занимает всё твоё место, в котором ты живёшь"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто твои клиенты?",
                        Options = new[]
                        {
                            "Местные фиксеры, которые присылают к тебе клиентов",
                            "Местные банды, которые также защищают тебя, пока ты устраняешь урозы в СЕТи",
                            "Руководители корпораций, которые используют тебя в \"черных проектах\"",
                            "Местные соло или другие боевики, которые используют тебя, для обеспечения безопасности своих персональных систем",
                            "Местные кочевники и фиксеры, для обеспечения безопасности своих семей",
                            "Ты работаешь на себя и продаёшь всё, что находишь в сети"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Где ты берешь программы?",
                        Options = new[]
                        {
                            "Находишь в старых заброшенных Городских Зонах.",
                            "Крадешь у других нетраннеров, когда сжигаешь им мозги.",
                            "Местный фиксер поставляет тебе программы в обмен на халтурки",
                            "Корпораты предоставляют тебе программы в обмен на услуги",
                            "У тебя есть лазейки в несколько корпоративных складов",
                            "Посещаешь Ночные рынки и покупаешь программы когда можешь"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто охотится за тобой?",
                        Options = new[]
                        {
                            "Ты думаешь, что это убийца-ИИ или Призрак СЕТи. В любом случае, это плохие новости",
                            "Другие нетраннеры, которым ты просто не нравишься",
                            "Корпорации, которые хотят, чтобы ты работал исключительно на них",
                            "Законники, которые считают тебя преступником и хотят арестовать",
                            "Старые клиенты, которые думают, что ты их обманул",
                            "Фиксеры или другие клиенты, которые хотят, чтобы ты работал только на них"
                        }
                    }
                }
            },
            {
                "Техник", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какой ты специалист?",
                        Options = new[]
                        {
                            "Специалист кибернетик",
                            "Автомеханик",
                            "Мастер на все руки",
                            "Мастер мелкой электроники",
                            "Оружейник",
                            "Сумасшедший изобретатель",
                            "Робототехник (роботы и дроны)",
                            "Механик тяжелого машиностроения",
                            "Мусорщик",
                            "Морской механик"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Как выглядит твое рабочее место?",
                        Options = new[]
                        {
                            "Хаос и чертёжная бумага",
                            "Всё разложено по цветам, но всё еще кошмар",
                            "Полностью цифровой, с ежедневным резервным копированием",
                            "Ты работаешь на своём Агенте",
                            "Ты хранишь всё подряд, вдруг в будущем сгодится",
                            "Только ты понимаешь эту файловую систему"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Если есть партнёр, то кто он?",
                        Options = new[]
                        {
                            "Работаешь один",
                            "Член семьи",
                            "Старый друг",
                            "Романтический партнёр",
                            "Наставник",
                            "Тайный партнер со связями в мафии/банде",
                            "Тайный партнер со связями в корпорации"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто твои главные клиенты?",
                        Options = new[]
                        {
                            "Местные фиксеры, которые дают тебе клиентов",
                            "Местные банды, которые крышуют тебя, пока работаешь",
                            "Менеджеры корпораций, использующие тебя для “черных проектов”",
                            "Местные Соло или другие боевики, обслуживающие оружие у тебя",
                            "Кочевники и Фиксеры, приносящие “найденную” технику для ремонта",
                            "Ты работаешь на себя и продаёшь то, что изобрел/ремонтировал"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Где ты берешь материалы?",
                        Options = new[]
                        {
                            "Находишь в разрушенных заброшенных городских зонах.",
                            "Снимаешь снаряжение с тел после перестрелки",
                            "Местный Фиксер поставляет тебе припасы в обмен на ремонтные работы",
                            "Корпораты предоставляют материалы в обмен на услуги",
                            "У тебя есть лазейки в несколько корпоративных складов",
                            "Посещаешь Ночные рынки и покупаешь материалы когда есть возможность"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто за тобой охотится?",
                        Options = new[]
                        {
                            "Бандиты из Боевой Зоны, которые хотят, чтобы ты работал только на них",
                            "Техник конкурент хочет украсть твоих клиентов",
                            "Корпорации, которые хотят, чтобы ты работал исключительно на них",
                            "Крупный бизнес хочет обнулить тебя, потому что ты угрожаешь их продажам",
                            "Старый клиент, который думает, что ты его обманул",
                            "Конкуренты пытаются выбить у тебя ресурсы и запчасти"
                        }
                    }
                }
            },
            {
                "Медтехник", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какой ты Медтехник?",
                        Options = new[]
                        {
                            "Хирург",
                            "Врач общей практики",
                            "Травматолог",
                            "Психиатр",
                            "Терапевт по случаям Киберпсихоза",
                            "Риппер",
                            "Оператор криосистем",
                            "Фармацевт",
                            "Бодискульптор",
                            "Судебный патологоанатом"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Расскажи о своём партнере?",
                        Options = new[]
                        {
                            "Работаю один",
                            "Группа Trauma Team",
                            "Старый друг",
                            "Романтический партнёр",
                            "Член семьи",
                            "Тайный партнер со связями в мафии/банде",
                            "Тайный партнер со связями в корпе"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Твое рабочее место",
                        Options = new[]
                        {
                            "Стерилизуется ежедневно по утрам",
                            "Это хоть и не последнее слово техники, но для тебя всё удобно",
                            "Криокамера используется, как холодильник",
                            "Все одноразовое и хранится в вакууме, пока не пригодится",
                            "Не так чисто, как хотелось бы вашим пациентам",
                            "Организованное, профессиональное и стерильное"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто твои клиенты?",
                        Options = new[]
                        {
                            "Местные фиксеры присылают к тебе клиентов",
                            "Местные бандиты, которые охраняют твою рабочую зону или дом в обмен на медпомощь",
                            "Менеджеры корпораций, которые используют тебя для “черных проектов”",
                            "Местные Соло или другие боевики, которые обращаются к тебе за мед помощью",
                            "Местные Кочевники и Фиксеры, которые приносят к тебе раненых клиентов",
                            "Работаешь в Trauma Team фельдшером"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Где ты берешь материалы?",
                        Options = new[]
                        {
                            "Находишь мед.припасы в старых заброшенных городских зонах",
                            "Вырезаешь из тел после перестрелки",
                            "Местный фиксер поставляет припасы в обмен на мед помощь",
                            "Корпораты или Trauma Team предоставляют тебе материалы в обмен на услуги",
                            "У тебя есть лазейки в несколько корпоративных или больничных складов",
                            "Посещаешь Ночные рынки и покупаешь материалы когда есть возможность"
                        }
                    }
                }
            },
            {
                "Медиа", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какой ты Медиа?",
                        Options = new[]
                        {
                            "Блогер",
                            "Писатель (книги)",
                            "Видеооператор",
                            "Документалист",
                            "Репортёр-криминалист",
                            "Уличный писака"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Как твоя работа находит огласку?",
                        Options = new[]
                        {
                            "Ежемесячный журнал",
                            "Блог",
                            "Стримы",
                            "Новостной канал",
                            "\"Книжные\" магазины",
                            "Скрим-листы"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Насколько ты этичен?",
                        Options = new[]
                        {
                            "Справедливая и честная отчетность, строгие нормы. Ты сообщаешь только проверенную информацию",
                            "Справедливые и честные репортажи, но иногда опираешься на слухи. Если это необходимо",
                            "Иногда оступаешься и делаешь неэтичные вещи, но редко. У тебя есть какие-никакие стандарты",
                            "Готов нарушить любые правила, чтобы проучить плохих парней. Но исключительно плохих парней",
                            "Ты безжалостен и полон решимости добиться успеха, даже если нужно нарушить закон",
                            "Коррупция твоё второе имя. Ты постоянно берешь взятки и участвуешь в незаконных и неэтичных репортажах. Твоя ручка принадлежит тому, кто даст больше денег"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "О чем ты рассказываешь?",
                        Options = new[]
                        {
                            "Политика",
                            "Экология",
                            "Новости знаменитостей",
                            "Корпоративные разборки",
                            "Редакционные материалы",
                            "Пропаганда"
                        }
                    }
                }
            },
            {
                "Законник", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Должность в структуре",
                        Options = new[]
                        {
                            "Сторож",
                            "Пеший патрульный",
                            "Расследование преступлений",
                            "SWAT",
                            "Мото-/ автопатруль",
                            "Отдел внутренних расследований"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Где проходит твоя юрисдикция?",
                        Options = new[]
                        {
                            "Корпоративные зоны",
                            "Городское патрулирование",
                            "Боевая зона",
                            "Пригород",
                            "Зона реконструирования",
                            "Шоссе"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Насколько ты коррумпирован?",
                        Options = new[]
                        {
                            "Сведливость, честность, закон",
                            "Справедливость, честность, пытки плохих парней",
                            "Иногда бываешь неэтичными, но редко",
                            "Нарушаешь все правила, чтобы побороть преступность",
                            "Безжалостен и полон решимости. Контролируешь Улицы даже если это влечёт нарушение закона",
                            "Настоящий взяточник. Ты постоянно берешь взятки и ведешь незаконные дела"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто охотится на тебя?",
                        Options = new[]
                        {
                            "ОПГ",
                            "Бустеры",
                            "Служба внутренних расследований",
                            "Грязные политики",
                            "Контрабандисты",
                            "Уличное отребье"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Какая твоя главная цель?",
                        Options = new[]
                        {
                            "ОПГ",
                            "Бустеры",
                            "Наркоманы и закладчики",
                            "Грязные политики",
                            "Контрабандисты",
                            "Уличное отребье"
                        }
                    }
                }
            },
            {
                "Корпорат", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Чем занимается корпа в которой ты работаешь?",
                        Options = new[]
                        {
                            "Финансы",
                            "Медиа и коммуникации",
                            "Кибер- и медицинские технологии",
                            "Фармацевтика и биотех",
                            "Еда, одежда и другие товары широкого потребления",
                            "Производство энергии",
                            "Персональная электроника и робототехника",
                            "Корпоративные услуги",
                            "Потребительские услуги",
                            "Недвижимость и строительство"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "В каком отделе ты работаешь?",
                        Options = new[]
                        {
                            "Закупки",
                            "Производство",
                            "Исследования и разработка",
                            "HR",
                            "Маркетинг и связь с общественностью",
                            "Поглощение и слияние"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Насколько хороша/плоха твоя корпа?",
                        Options = new[]
                        {
                            "Всегда работаем на благо, полностью следуем этическим нормам.",
                            "Всегда работаем как честный бизнес",
                            "Изредка делаем неэтичные вещи",
                            "Готовы нарушать правила, чтобы достичь цели",
                            "Безжалостный, ориентированный на прибыль, бизнес",
                            "Абсолютное зло. Занимается исключительно незаконными и неэтичными делами"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Какого размера твоя корпа?",
                        Options = new[]
                        {
                            "Один город",
                            "Несколько городов",
                            "Офисы по всему штату",
                            "Национальный масштаб",
                            "Международная корпа, офисы в крупных городах",
                            "Международная корпа, офисы повсюду"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто охотится за тобой?",
                        Options = new[]
                        {
                            "Конкуренты в той же отрасли",
                            "Законники следят за тобой",
                            "Местные СМИ пытаются уничтожить бизнес",
                            "Подразделения твоей корпы враждуют друг с другом",
                            "Местным властям не нравится твоя корпа",
                            "Международные корпы хотят поглотить твою корпорацию"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Отношения с твоим боссом",
                        Options = new[]
                        {
                            "Босс наставляет тебя, но остерегайся его врагов",
                            "Босс даёт тебе полную свободу действий и не хочет знать, чем ты занимаешься",
                            "Твой босс микроменеджер, который пытается лезть в твои дела",
                            "Твой босс шиз. Его непредсказуемые выходки компенсируются тихой паранойей",
                            "Твой босс крут и прикрывает твою спину от соперников",
                            "Боссу угрожает твой стремительный взлёт. Он хочет зарезать тебя"
                        }
                    }
                }
            },
            {
                "Фиксер", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какой ты Фиксер?",
                        Options = new[]
                        {
                            "Брокерские сделки между бандами",
                            "Находишь редкие вещи для эксклюзивной клиентуры",
                            "Предоставляешь услуги Соло или Техников в качестве агента",
                            "Поставляешь товары на Ночной рынок. В основном еду, лекарства и препараты",
                            "Добываешь незаконные ресурсы, такие как наркотики или оружие",
                            "Поставляешь материалы для техников и медтехов",
                            "Управляешь несколькими Ночными рынками, но не владеешь ими",
                            "Заключаешь контракты на тяжелую, военную технику и самолеты",
                            "Выступаешь в качестве брокера для мусорщиков, совершающих набеги на Корпы или Боевые зоны",
                            "Ты эксклюзивный агент для Медиа, Рокербоя или семьи Кочевников"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Есть партнёр? Кто?",
                        Options = new[]
                        {
                            "Работаешь один",
                            "Член семьи",
                            "Старый друг",
                            "Романтический партнёр",
                            "Наставник",
                            "Тайный партнер со связями в мафии/банде",
                            "Тайный партнер со связями в корпорации"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Какой у тебя офис?",
                        Options = new[]
                        {
                            "У тебя его нет. Проще быть мобильным",
                            "Стенд в баре",
                            "Все сообщения через Дата Пулы и анонимные тайники",
                            "Помещение склада, магазина или больницы",
                            "Заброшенное здание",
                            "Вестибюль кубического отеля"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто твои остальные клиенты?",
                        Options = new[]
                        {
                            "Местные Рокербои или Медиа, которым ты нужен, чтобы устроить концерт или найти контакты",
                            "Местные банды, которые защищают твоё рабочее место или дом",
                            "Менеджер Корпораций, которому ты нужен, чтобы проводить закупки для \"черных проектов\"",
                            "Местные Соло и другие боевики, которые ищут через тебя работу или контакты",
                            "Местные Кочевники или Другие фиксеры, которые проводят сделки через тебя",
                            "Политики или Корпораты, добывающие через тебя информацию"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто охотится за тобой?",
                        Options = new[]
                        {
                            "Бандиты из боевых зон, считающие, что ты должен работать на них",
                            "Фиксеры конкуренты пытаются украсть твоих клиентов",
                            "Корпа, желающая, чтобы ты работал только на них",
                            "Враг бывшего клиента, который хочет \"подчистить концы\" — тебя",
                            "Старый клиент, думающий, что ты его обманул",
                            "Конкурирующий Фиксер пытается обойти тебя в борьбе за ресурсы и детали"
                        }
                    }
                }
            },
            {
                "Кочевник", new RoleLifepathTable[]
                {
                    new RoleLifepathTable
                    {
                        Title = "Какого размера стая?",
                        Options = new[]
                        {
                            "Одно племя или семья",
                            "Пара десятков человек",
                            "Сорок или пятьдесят членов",
                            "Сто и более",
                            "Кровная семья (несколько сотен)",
                            "Кооператив семей (несколько кровных семей)"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Стая базируется на суше, в воздухе или воде?",
                        Options = new[]
                        {
                            "Сухопутные",
                            "Воздушные",
                            "Морские"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Чем занимается твоя Стая на суше?",
                        DependsOn = "Стая базируется на суше, в воздухе или воде?",
                        ShowIf = new[] { "Сухопутные" },
                        Options = new[]
                        {
                            "Дорожная банда",
                            "Перевозка пассажиров",
                            "Шатры/школы",
                            "Путешествующее шоу/цирк",
                            "Мигранты-фермеры",
                            "Транспортировка грузов",
                            "Защита перевозок",
                            "Контрабанда",
                            "Наёмная армия",
                            "Бригада строительных рабочих"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Чем занимается твоя Стая в воздухе?",
                        DependsOn = "Стая базируется на суше, в воздухе или воде?",
                        ShowIf = new[] { "Воздушные" },
                        Options = new[]
                        {
                            "Воздушное пиратство",
                            "Транспортировка грузов",
                            "Перевозка пассажиров",
                            "Защита воздушных судов",
                            "Контрабанда",
                            "Поддержка в боевых операциях"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Чем занимается твоя Стая на море?",
                        DependsOn = "Стая базируется на суше, в воздухе или воде?",
                        ShowIf = new[] { "Морские" },
                        Options = new[]
                        {
                            "Пиратство",
                            "Транспортировка грузов",
                            "Перевозка пассажиров",
                            "Контрабанда",
                            "Поддержка в боевых операциях",
                            "Подводная война"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Что ты делаешь для клана?",
                        Options = new[]
                        {
                            "Разведчик (переговорщик)",
                            "Воин на транспорте (защита и поддержка огнём)",
                            "Пилот/Водитель",
                            "Мастер-перевозчик (негабаритные грузы/дальнобойщик)",
                            "Одинокий контрабандист",
                            "Закупки (топливо, тачки и т.д.)"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Какая философия твоей стаи?",
                        Options = new[]
                        {
                            "Работа во благо. Дом для всех, кто хочет жить мирно",
                            "Больше похоже на семейный бизнес. Справедливая и честная компания",
                            "Иногда делаем неэтичные вещи, но редко",
                            "Нарушаем правила, когда они мешают получить то, что нужно клану",
                            "Безжалостна и эгоцентрична, готова на любые поступки, если это может в процветании клана",
                            "Зло во плоти. Вы ужас дорог, мчитесь по шоссе убивая, грабя, терроризируя и насилуля каждого"
                        }
                    },
                    new RoleLifepathTable
                    {
                        Title = "Кто охотится за вашей стаей?",
                        Options = new[]
                        {
                            "ОПГ",
                            "Бустеры",
                            "Наркокурьеры",
                            "Грязные политиканы",
                            "Конкурирующий клан с похожим бизнесом",
                            "Грязные копы"
                        }
                    }
                }
            }
        };
    }
}
